Autodesk.Revit.DB.Structure.AnalyticalLink.IsAutoGenerated
Specifies whether or not an AnalyticalLink was created by an Analytical Element.
Returns:
True if AnalyticalLink was created by an Analytical Element, false otherwise.
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLink.IsValidHub(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether input hub is valid for an AnalyticalLink.
doc:
Hubs's document.
hubId:
Hub to test for validity.
Returns:
True is returned when provided hubId points hub that is valid for AnalyticalLink, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLink.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of a AnalyticalLink element between two Hubs.
doc:
Document to which new AnalyticalLink should be added.
type:
AnalyticalLinkType for the new AnalyticalLink.
startHubId:
Hub at start of AnalyticalLink.
endHubId:
Hub at end of AnalyticalLink.
Returns:
The newly created AnalyticalLink instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
startHubId is not a valid Hub ID for an AnalyticalLink element.
-or-
endHubId is not a valid Hub ID for an AnalyticalLink element.
-or-
Thrown if startHubId or endHubId do not represent ids of Hubs.
-or-
Thrown if startHubId == endHubId.
-or-
Thrown if type does not represent an id of an AnalyticalLinkType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLink.OwnerId
ElementId of Analytical Element which created the AnalyticalLink (if any)
invalidElementId if this Analytical Link was created by the User or API
Since:
2013

Autodesk.Revit.DB.Structure.AnalyticalLink
An analytical link element that is used to create connections between other Analytical Elements.
Since:
2013